import socket


# ==========================================
# 1. 创建 TCP Socket
# ==========================================

server = socket.socket(socket.AF_INET, socket.SOCK_STREAM)


# ==========================================
# 2. 允许树莓派监听自己的所有网络接口
# ==========================================

HOST = "0.0.0.0"
PORT = 5000

server.bind((HOST, PORT))


# ==========================================
# 3. 开始监听
# ==========================================

server.listen(1)

print("==============================")
print("水位传感器服务器启动")
print("==============================")
print("等待 ESP32 连接...")
print()


# ==========================================
# 4. 等待 ESP32
# ==========================================

conn, addr = server.accept()

print("ESP32 已连接！")
print("ESP32 地址：", addr)
print()


# ==========================================
# 5. 不断接收数据
# ==========================================

while True:

    data = conn.recv(1024)

    # 如果没有数据，说明连接断开
    if not data:
        print("ESP32 已断开连接")
        break

    # 把收到的字节转换成字符串
    message = data.decode()

    print("收到水位数据：", message)


# ==========================================
# 6. 关闭连接
# ==========================================

conn.close()
server.close()